"USSD_ERROR" = "Hiba a kérés végrehajtásakor";
"USSD_TERMINATED" = "Munkafolyamat lezárult";

"%@ Call Forwarding\n%@\n%@%@" = "%@ Hívásátirányítás\n%@\n%@%@";
"%@ Call Waiting\n%@" = "%@ Hívásvárakoztatás\n%@";
"%@ Call Barring\n%@\n%@" = "%@ Hívástiltás\n%@\n%@";
"%@ Fixed Dialing\n%@" = "%@ Fix tárcsázás\n%@";
"Connected Line Presentation\n%@" = "Hívóazonosító\n%@";
"Calling Line Presentation\n%@" = "Hívóazonosító\n%@";
"Connected Line ID Restriction\n%@" = "Hívóazonosító korlátozása\n%@";
"Calling Line ID Restriction\n%@" = "Hívóazonosító korlátozása\n%@";
"SIM Lock\n%@" = "SIM-zár\n%@";
"Service Center Address\n%@" = "Szolgáltatásközpont címe\n%@";
"Supplementary Service Password\n%@" = "Kiegészítő szolgáltatási jelszó\n%@";
"Calling Name Presentation\n%@" = "Hívóazonosító\n%@";

"Forwards to %@\n" = "Átirányít ide: %@\n";

"All Calls" = "Összes hívás";
"All Conditional Calls" = "Összes feltételes hívás";
"Async Data Circuit" = "Aszinkron adatáramkör";
"Data" = "Adat";
"Fax" = "Fax";
"Packet Access" = "Csomaghozzáférés";
"Pad Access" = "Gombhozzáférés";
"SMS" = "SMS";
"Sync Data Circuit" = "Szinkron adatáramkör";
"Voice" = "Hang";

"All Outgoing" = "Összes kimenő";
"All Incoming" = "Összes bejövő";
"Outgoing International" = "Kimenő nemzetközi";
"Outgoing International, Except Home Country" = "Kimenő nemzetközi, kivéve a hazai országot";
"Incoming While Roaming Outside Home Country" = "Bejövő a hazai területen kívüli roamingoláskor";
"Incoming, Not On SIM" = "Bejövő, nem a SIM-en";
"All Services" = "Összes szolgáltatás";
"All Outgoing Services" = "Összes kimenő szolgáltatás";
"All Incoming Services" = "Összes bejövő szolgáltatás";

"Disabled" = "Kikapcsolva";
"Enabled" = "Bekapcsolva";

"On All Calls" = "Minden hívásra";
"When Busy" = "Ha foglalt";
"When Unanswered" = "Ha nem fogadott";
"When Unreachable" = "Ha nem elérhető";

"Setting %@ Succeeded" = "A(z) %@ beállítása sikeres volt\n";
"Setting Interrogation Succeeded" = "A lekérdezési beállítás sikeres volt\n";
"Setting %@ Failed" = "A(z) %@ beállítása sikertelen volt\n";
"Setting Interrogation Failed" = "A lekérdezési beállítás sikertelen volt\n";

"Not Available" = "Nem elérhető";
"Network Controlled" = "Hálózatvezérelt";
"Temporarily Disabled" = "Átmenetileg kikapcsolva";
"Temporarily Enabled" = "Átmenetileg bekapcsolva";
"Unknown" = "Ismeretlen";

"Activation" = "Aktiválás";
"Deactivation" = "Deaktiválás";
"Interrogation" = "Lekérdezés";
"Registration" = "Regisztráció";
"Erasure" = "Törlés";

"No Address" = "Nincs cím";
"No Service Specified" = "Nincs megadott szolgáltatás";
"Type %d" = "%d típus";

// generic error
"CALL_FAILED" = "Hívás sikertelen";
// error codes
"kCTNoError" = "Nincs hiba";
"kCTUnknownError" = "Ismeretlen hiba";
"kCTErrorRadioFailure" = "Rádióhiba";
// Generic network errors
"kCTErrorNetworkFailure" = "Hálózati hiba";
"kCTErrorCongestion" = "Hálózat zsúfolt";
"kCTErrorUnidentifiedSubscriber" = "Azonosítatlan előfizető";
"kCTErrorFacilityRejected" = "Képesség elutasítva";
"kCTErrorUnknownSubscriber" = "Ismeretlen előfizető";
"kCTErrorNetworkOutOfOrder" = "Hálózat üzemen kívül";
"kCTErrorInvalidTransactionIdentifier" = "Érvénytelen tranzakcióazonosító";
"kCTErrorSemanticallyIncorrectMessage" = "Szemantikusan helytelen üzenet";
"kCTErrorInvalidMandatoryInformation" = "Érvénytelen kötelező információ";
"kCTErrorMessageTypeNonExistant" = "Nem létező üzenettípus";
"kCTErrorMessageNotCompatibleWithProtocolState" = "Az üzenet nem kompatíbilis a protokoll állapotával";
"kCTErrorInformationElementNonExistant" = "Nem létező információelem";
"kCTErrorProtocolErrorUnspecified" = "Meghatározatlan protokollhiba";
"kCTErrorTemporaryFailure" = "Átmeneti hiba";
"kCTErrorResourcesUnavailable" = "Erőforrások nem elérhetők";
"kCTErrorRequestedFacilityNotSubscribed" = "A kért képesség nincs előfizetve";
"kCTErrorRequestedFacilityNotImplemented" = "A kért képesség nincs implementálva";
"kCTErrorInterworkingError" = "Közreműködési hiba";
"kCTErrorInterworkingNotSupported" = "Közreműködés nem támogatott";
"kCTErrorCommandCannotBeActioned" = "Parancs nem hajtható végre";
"kCTErrorNoNetworkService" = "Nincs hálózati szolgáltatás";
// Call related errors
"kCTErrorUnassignedNumber" = "Társítatlan szám";
"kCTErrorOperatorDeterminedBarring" = "Szolgáltató által meghatározott tiltás";
"kCTErrorCallBarred" = "Hívás tiltva";
"kCTErrorUserBusy" = "Felhasználó foglalt";
"kCTErrorNoUserResponding" = "Nincs felhasználói válasz";
"kCTErrorNumberChanged" = "Szám módosult";
"kCTErrorInvalidNumberFormat" = "Érvénytelen számformátum";
"kCTErrorCallRejected" = "Hívás elutasítva";
// SIM errors
"kCTErrorSimNotInserted" = "SIM nincs behelyezve";
"kCTErrorSimPinRequired" = "SIM PIN szükséges";
"kCTErrorSimPukRequired" = "SIM PUK szükséges";
"kCTErrorSimFailure" = "SIM-hiba";
"kCTErrorSimMemoryFailure" = "SIM memóriahiba";
"kCTBadPinFormatError" = "Rossz PIN formátum";
"kCTErrorNumberNotAllowed" = "Szám nem engedélyezett";
"kCTErrorIncorrectPassword" = "Helytelen jelszó";
// SMS Errors
"kCTErrorShortMessageTransferRejected" = "Rövid üzenet továbbítása elutasítva";
"kCTErrorDestinationOutOfOrder" = "Cél üzemen kívül";
"kCTErrorClass0NotSupported" = "0 osztály nem támogatott";
"kCTErrorCannotReplaceSm" = "SIM nem cserélhető ki";
"kCTErrorUnspecifiedPid" = "Meghatározatlan PID";
"kCTErrorDataCodingSchemeNotSupported" = "Adatkódolási séma nem támogatott";
"kCTErrorUnspecifiedDcs" = "Meghatározatlan DCS hiba";
"kCTErrorCommandUnsupported" = "Parancs nem támogatott";
"kCTErrorUnspecifiedTpCommand" = "Meghatározatlan TP parancshiba";
"kCTErrorTpduNotSupported" = "TPDU nem támogatott";
"kCTErrorScBusy" = "SC foglalt";
"kCTErrorRejectedBySimSmsControl" = "A SIM SMS vezérlés által elutasítva";
// GPRS Errors
"kCTErrorGprsIllegalMs" = "GPRS illegális MS";
"kCTErrorGprsIllegalMe" = "GPRS illegális ME";
"kCTErrorGprsServicesNotAllowed" = "GPRS szolgáltatások nem engedélyezettek";
"kCTErrorGprsPlmnNotAllowed" = "GPRS PLMN nem engedélyezett";
"kCTErrorGprsLocationAreaNotAllowed" = "GPRS helyszín nem engedélyezett";
"kCTErrorGprsRoamingNotAllowedInLocationArea" = "GPRS roaming nem engedélyezett a helyszínen";
"kCTErrorGprsServiceOptionNotSupported" = "GPRS szolgáltatási opció nem támogatott";
"kCTErrorGprsServiceOptionNotSubscribed" = "GPRS szolgáltatási opció nincs előfizetve";
"kCTErrorGprsServiceOptionTemporarilyOutOfOrder" = "GPRS szolgáltatási opció átmenetileg üzemen kívül";
"kCTErrorGprsPdpAuthenticationFailure" = "GPRS PDP hitelesítés sikertelen";
"kCTErrorGprsInvalidMobileClass" = "GPRS érvénytelen mobil osztály";
"kCTErrorGprsUnspecified" = "GPRS nincs megadva";
"kCTErrorGprsMissingorUnknownAPN" = "GPRS hiányzik vagy ismeretlen APN";
"kCTErrorGprsPDPAuthenticationInfoRejectedByBaseband" = "GPRS PDP hitelesítési infó a Baseband által elutasítva";
